Docker包括三个基本概念：
1. 镜像（Image）
2. 容器（Container）
3. 仓库（Repository）

Docker镜像：
1）Docker镜像就是一个只读的模板
例如一个镜像可以包含一个完整的ubuntu操作系统环境，里面仅安装了Apache或用户需要的其它程序
2）镜像可以用来创建Docker容器
Docker提供了一个很简单的机制来创建镜像或者更新现有的镜像

Docker容器：
1）Docker利用容器来运行应用
2）容器是从镜像创建的运行实例，它可以被启动、开始、停止、删除，每个容器都是相互隔离的、保证安全的平台
3）可以把容器看作一个简易版的Linux环境（包括root用户权限、进程空间、用户空间和网络空间等）和运行在其中的应用程序

Docker仓库：
1） 仓库是集中存放镜像文件的场所，有时候把仓库和仓库注册服务器（Registry）混为一谈，并不严格区分，实际上，仓库注册服务器上往往存放着多个仓库，每个仓库又包含了多个镜像，每个镜像有不同的标签（tag）
2） 仓库分为公开仓库（Public）和私有仓库（Private）两种形式
3） 最大的公开仓库是Docker Hub，存放了数量庞大的镜像供用户下载
4） 国内的公开仓库包括Docker Pool等
5） 用户可以在本地网络内创建一个私有仓库

