## expr, 手工命令行计数器

### 语法
expr 表达式

表达式说明:
> * 用空格隔开每个项
> * 用\\(反斜杠)放在shell特定字符前面
> * 对包含空格和其他特殊字符的字符串要用引号括起来

### 实例
<pre>
//计算字符串长度
expr length "this is a test"
> 14
//抓取字串
expr substr "this is a test" 3 5
> is is
//抓取第一个字符数字串出现的位置
expr index "sarasara" a
> 2
//整数运算
expr 14 % 9
> 5
expr 10 + 10
> 20
expr 1000 + 900
> 1900
expr 30 / 3 /2 
> 5
expr 30 \* 3
> 90
//使用乘号时, 必须用反斜线屏蔽其特定含义
</pre>

### 注意
1. expr在使用中要注意一些书写，如表达式中量和运算符号之间的空格及一些运算符号需要转义
2. expr只适用于整数之间的运算
